dimitarm1/STM8_samples/led_termostat_into_serial_remote_controller/main.c
#define UART_PORT		PD
#define UART_TX_PIN		GPIO_PIN5
void uart_init(void){
	// PD5 - UART2_TX
	PD_DDR |= UART_TX_PIN;
	PD_CR1 |= UART_TX_PIN;
	
	UART1_CR2 = 0;
// Configure UART
	// 8 bit, no parity, 1 stop (UART_CR1/3 = 0 - reset value)
	// 1200 on 16MHz: BRR1=0x41, BRR2=0x35
#ifndef BAUD_9600	
	UART1_BRR1 = 0xCD; UART1_BRR2 = 0x33; //taka stava!!
#else	
	UART1_BRR1 = 0x1B; UART1_BRR2 = 0x2F; //taka stava!!
#endif
	
	if(	settings->address != 0x10) 
	{
	//No External remote control	
	UART1_CR2 = UART_CR2_TEN; // Allow TX, 
	UART1_CR2 |= UART_CR2_REN | UART_CR2_RIEN; // Allow RX, 
	}
	 // Allow RX/TX, generate ints on rx
	//UART1_CR1 = 0; // Enable UART?	 
}

/**
 * Send one byte through UART
 * @param byte - data to send
 */
void UART_send_byte(U8 byte){
	while(!(UART1_SR & UART_SR_TXE)); // wait until previous byte transmitted
	UART1_DR = byte;
}

/*	Character reception routine.
 *	This routine is called on interrupt.
 *	It puts the received char in the buffer.
 */
@interrupt void recept(void)
{
	
	data = UART1_SR;			/* clear interrupt */
	if(!(data & UART_SR_RXNE)) return;
	data = UART1_DR;		/* get the char */
#ifdef DISTANCIONNO_SERIAL
	data_received = 1;

#else
  if(data & 0x80)  // Command received
    {
      device = (data & 0x78)>>3; 
#ifdef BAUD_9600		
      receiver_timeout = 350;       
#else
			receiver_timeout = 40;       
#endif
      /*
 * commads:
       * 0 - status 0-free, 1-Working, 2-COOLING, 3-WAITING
       * 1 - start
       * 2 - set pre-time
       * 3 - set cool-time
       * 4 - stop - may be not implemented in some controllers
       * 5 - set main time
       */
		if (device == settings->address)
      switch(data & 0x07)
      {
      case 0: // ststus
        data = device_status<<6;
        switch (device_status)
        {
          case STATUS_FREE:
            break;
          case STATUS_WORKING:
            data = data | ToBCD(!!(main_time%60) + main_time/60);
            break;
          case STATUS_COOLING:
            data = data | ToBCD(!!(cool_time%60) + cool_time/60);
            break;
          case STATUS_WAITING:
            data = data | ToBCD(!!(pre_time%60) + pre_time/60);
            break;
          default:
            break;
        }
        UART_send_byte(data);
        receiver_state = STATE_WAIT_COMMAND;
        break;
      case 1: // start
        receiver_state = STATE_WAIT_VALIDATE_START;                        
        break;
      case 2: // set pre_time
        receiver_state = STATE_WAIT_PRE_TIME;                      
        break;
      case 3: // set cool_time
        receiver_state = STATE_WAIT_COOL_TIME;                        
        break;
      case 4: // stop
        receiver_state = STATE_WAIT_COMMAND;
        if(pre_time == 0 && main_time > 0)
        {
          main_time = 0;                          
        }
        else
        {
          cool_time = 0;
          main_time = 0;
          pre_time = 0;                            
        }
        if(device_status > 0)
        {
          //updateDeviceStatus();
        }
        break;
      case 5: // set main time
        receiver_state = STATE_WAIT_MAIN_TIME;            
        break;
      default:
        break;
      }
    }
    else // Data recevied ?
    if(receiver_state != STATE_WAIT_COMMAND)
    {
      switch(receiver_state)
      {
        case STATE_WAIT_PRE_TIME:          
          if(data>9)data = 9;
          pre_time_serial = (data);          
          receiver_state = STATE_WAIT_COMMAND;
          break;
        case STATE_WAIT_MAIN_TIME:                                        
          main_time_serial = FromBCD(data);       
          UART_send_byte(main_time_serial);
          receiver_state = STATE_WAIT_COMMAND;
          break;
        case STATE_WAIT_COOL_TIME:       
          if(data>9) data = 9;
          cool_time_serial = (data);
          time_in_hex = ToBCD(main_time_serial);
          checksum = (pre_time_serial + cool_time_serial - time_in_hex - 5) & 0x7F;
					UART_send_byte(checksum);
          receiver_state = STATE_WAIT_CHECKSUM;                                                          
          break;
        case STATE_WAIT_CHECKSUM:   
          time_in_hex = ToBCD(main_time_serial);
          checksum = (pre_time_serial + cool_time_serial - time_in_hex - 5) & 0x7F;     
          if((char)data == (char)checksum)
          {
            if(main_time_serial > 60) main_time_serial = 60;            
						main_time = main_time_serial*60;
						pre_time = pre_time_serial*60;
						cool_time = cool_time_serial*60;
            //updateDeviceStatus();
          }
          receiver_state = STATE_WAIT_COMMAND;
          break;
        case STATE_WAIT_VALIDATE_START:        
          if(data == 0x55) //validate start
          {
            pre_time = 0;
            if(device_status > 0)
            {                           
              //updateDeviceStatus();
            }                                
          }
          receiver_state = STATE_WAIT_COMMAND;                                    
          break;
        default:
          break;
      }
    }	
#endif
}


unsigned char USART_Receive(int *timeout)
{
	data_received = 0;
	while(*timeout && !data_received)
	{
		*timeout--;
	}
	return data;
}
int ToBCD(int value)
{  
  int digits[3];
  int result;
  digits[0] = value %10;
  digits[1] = (value/10) % 10;
  digits[2] = (value/100) % 10;	
  result = digits[0] | (digits[1]<<4) | (digits[2]<<8);
  return result;
}

int FromBCD(int value){
  int digits[3];
  int result;
  digits[0] = value & 0x0F;
  digits[1] = (value>>4) & 0x0F;
  digits[2] = (value>>8) & 0x0F;
  result = digits[0] + digits[1]*10 + digits[2]*100;
  return result;
}

void updateDeviceStatus(void)
{
	if(cool_time > 0)
	{
		if(pre_time > 0)
		{
				device_status = STATUS_WAITING;
		}
		else if(main_time > 0)
		{
				device_status = STATUS_WORKING;				
		}
		else 
		{
				device_status = STATUS_COOLING;
				PB_ODR &= ~(1<<5); // Relay is on after delay				
		}
	}
  else
  {
      device_status = STATUS_FREE;			
	  PB_ODR |= (1<<5); // Relay is off
  }
  
  if( device_status == STATUS_WORKING)
  {
			PA_ODR |= (1<<2); // Relay is on			
			if(!counter_enabled)	PB_ODR &= ~(1<<5); // Relay is on after delay			
  }
  else
  {
      PA_ODR &= ~(1<<2); // Relay is off
  }
//  if( device_status == STATUS_WORKING || device_status == STATUS_COOLING)
//  {
//      digitalWrite(OUPTUT_OHLAJDANE_PIN,1);
//  }
//  else
//  {
//      digitalWrite(OUPTUT_OHLAJDANE_PIN,0);
//  }
//  Serial.print(F("\nNew device status:"));
//  Serial.print( device_status);
}

