dimitarm1/STM8_samples/led_termostat_into_serial_remote_controller/main.c
void InitIWDG(void)
{
  IWDG_KR  = 0x55;  // Erisim ac?l?yor. 
  IWDG_PR  = 0x06;  // Onbolucu degeri 256 olarak ayarlan?yor.
  IWDG_RLR = 0xFF;  // Say?c? 0xFF ten geriye dogru sayacak.
  IWDG_KR  = 0x00;  // Erisim kapat?l?yor.
  IWDG_KR  = 0xCC;  // Say?c? saymaya basl?yor.
}

//----------------------------- MAIN --------------------------
int main() {
	unsigned long T_LED = 0L;  // time of last digit update
	unsigned long T_time = 0L; // timer	
	U8 beep_delay = 0;
	int show_time_delay = 0;
	counter_enabled = 0;
	external_control =key_state = 0;
	work_hours = (work_hours_t*)EEPROM_START_ADDR;	

	settings = (settings_t*)(EEPROM_START_ADDR + sizeof(work_hours_t));

	keys_scan_buffer[0] = keys_scan_buffer[1] = keys_scan_buffer[2] = keys_scan_buffer[3] = 0;
	Global_time = 0L; // global time in ms
	ADC_value = 0; // value of last ADC measurement
	LED_delay = 1; // one digit emitting time

	// Configure clocking
	CLK_CKDIVR = 2<<3; // F_HSI = 16MHz, f_CPU = 16MHz
	// Configure pins
	CFG_GCR |= 1; // disable SWIM
	LED_init();
	uart_init();
	InitIWDG();
	// Configure Timer1
	// prescaler = f_{in}/f_{tim1} - 1
	// set Timer1 to 1MHz: 1/1 - 1 = 15
	TIM1_PSCRH = 0;
	TIM1_PSCRL = 3; // LSB should be written last as it updates prescaler
	// auto-reload each 1ms: TIM_ARR = 1000 = 0x03E8
	TIM1_ARRH = 0x03;
	TIM1_ARRL = 0xE8;
	// interrupts: update
	TIM1_IER = TIM_IER_UIE;
	// auto-reload + interrupt on overflow + enable
	TIM1_CR1 = TIM_CR1_APRE | TIM_CR1_URS | TIM_CR1_CEN;
	// configure ADC
	
  BEEP_OFF();
	
	_asm("rim");    // enable interrupts
		
	display_int_sec(0);
	
	show_next_digit(); // show zero
	pre_time = main_time = cool_time = 0;
	updateDeviceStatus();
	if(settings->address == 0x10)
		PD_ODR |= (1<<5);
	
	// Loop
	do 
	{
		U8 *test = (U8*)0x4010;
		U8 result;		
		ResetIWDG;
		if(second_elapsed) // set next timer value
		{
			// Each second -->		
			second_elapsed = 0;
			if(counter_enabled) counter_enabled--; // Fan delay timer
#ifdef werwer
			if(show_time_delay == 0)
				display_int_sec(curr_time/100);
#else
			if(external_control && settings->address == 0x10)
			{
				main_time++;
				display_int_sec(main_time);
			}
			else switch(device_status){
				case STATUS_FREE:
					if(show_time_delay == 0) display_int_sec(main_time);
				break;
				case STATUS_WAITING:
					if(pre_time) 
					{
						pre_time--;
						if(!pre_time)
						{
							BEEP_ON();
							beep_delay = 300;
							counter_enabled = 1;
							add_minutes_to_eeprom(main_time/60);						
							pre_time = 0;
							main_time++;
						}
					}
					display_int_sec(-pre_time);
				break;
				case STATUS_WORKING:
					if(main_time)	main_time--;
					display_int_sec(main_time);
				break;
				case STATUS_COOLING:
					if(cool_time)	cool_time--;
					display_int_sec(cool_time);
				break;
				default:
				break;
			}
#endif
			//LED_init(); // EMC or just Paranoya...
#ifdef DISTANCIONNO_SERIAL
			ping_status();
#else
			updateDeviceStatus();
#endif
			//if(i > 9999) i = -1200;
			// check ADC value to light up DPs proportionaly
		
			// values less than 206 == 0
			
		}
		if((U8)(Global_time - T_LED) > LED_delay)
		{
			if(receiver_state)
			{
				if(receiver_timeout)
				{
					receiver_timeout--;
				}
				else
				{
					receiver_state = STATE_WAIT_COMMAND;
				}
			}
			// Each ~3 mSec -->
			T_LED = Global_time;
			show_next_digit();	
			if(beep_delay)
			{
				beep_delay--;
				if(!beep_delay)
				{
					BEEP_OFF();
				}
			}
			if(show_time_delay)
			{
			  show_time_delay--;
				if(!show_time_delay)
				{
					display_int_sec(main_time); // Stop show time
				}				
			}
			
			result = scan_keys();		
			if(settings->address == 0x10)
			{
				if((key_state & KEY_0_PRESSED))
				{
					PD_ODR &= ~(1<<5);
				}
				else
				{
					PD_ODR |= (1<<5);
				}
			}
			if(result & KEY_0_PRESSED && settings->address != 0x10) // Start
			{				
				{
					if(device_status == STATUS_WAITING && ((pre_time_serial) || (pre_time < settings->address*60))) // - wait 3 sec from 1-st start press
					{
						if(pre_time > 0)
						{
							BEEP_ON();
							beep_delay = 200;
							counter_enabled = 1;
							add_minutes_to_eeprom(main_time/60);
							main_time++;
							pre_time = 0;
						}
					}
					if(device_status == STATUS_FREE)
					{
						BEEP_ON();
						beep_delay = 10;
						if(show_time_delay == 0 && main_time>0)
						{						
							if(pre_time > 0)
							{
								cool_time = 3*60; // Indicate manual start using Cool Time							
							}
							else
							{
								pre_time = settings->address*60; // Initial wait itme for manual operation
								device_status == STATUS_WAITING;
							}
						}
						else
						{						
							// Show Time
							//int i = work_hours->minutes + (int)(work_hours->hours_L) * 60 + (int)(work_hours->hours_H) * 60*60;
							S32 i = (S32)work_hours->minutes + 
								(S32)(work_hours->hours_L) * 100 +  
								(S32)(work_hours->hours_H) * 10000;
							display_int(i);
							show_time_delay = 6000;
						}
					}
				}
			}
			else 
			{		
					
				if(result && show_time_delay)
				{
					main_time = 0;
					show_time_delay = 0;
				}			
				if(device_status == STATUS_FREE)
				{
					if(result & KEY_3_PRESSED)// plus
					{
						if(main_time < 60*30)	main_time+=60;
						display_int_sec(main_time);
						BEEP_ON();
						beep_delay = 10;
						pre_time = settings->address*60;
					}
					if(result & KEY_2_PRESSED)// minus
					{
						if(main_time >= 60)
						{
							main_time -=60;
							display_int_sec(main_time);
						}
						BEEP_ON();
						beep_delay = 10;
					}
				}
			}
			
			if(result & KEY_1_PRESSED) //Stop
			{	
				if(	settings->address == 0x10)
				{	
					if(!external_control )
					{
						if( Global_time > 500)
						{
							main_time = 60;
							external_control = 50;
							cool_time = 3*60;
						}
					}
					else
					{
						external_control = 50;
					}
				}
				else
				{
					main_time = pre_time = cool_time = 0;
					if(device_status == STATUS_WORKING)
					{
						cool_time = 3*60;
						display_int_sec(cool_time);
					}
								
					BEEP_ON();
					beep_delay = 40;
					show_time_delay = 0;			
				}
			}
			else
			{
				if(	settings->address == 0x10 && !(key_state & KEY_1_PRESSED && Global_time > 1500))
				{	
					if(external_control )
					{
						external_control--;
						if(!external_control)
						{
							main_time = 0;
							cool_time = 3*60;
							display_int_sec(cool_time);
						}
					}
					
