dimitarm1/STM8_samples/led_termostat_into_serial_remote_controller/main.c
				}				
			}
			if((result & KEY_PRESSED) == KEY_PRESSED && Global_time < 1000)
			{
				BEEP_ON();
				beep_delay = 40;		
				clear_eeprom();
			}		
			if((result & KEY_PRESSED) == KEY_2_PRESSED && Global_time < 1000)
			{
				increment_address_in_EEPROM();
				if(settings->address>15)
				{
					display_int_sec(-1000000);
				}
				else
				{
					display_int_sec(settings->address);
				}
			}
		}	
		
	} while(1);
}


#ifdef DISTANCIONNO_SERIAL
void ping_status(void){

	static int ping_index = 0;
	volatile static int status_codes[4];
	// Ping solarium for status
	{
		int sts;
		ping_index = (ping_index + 1) & 0x03;
		status_codes[ping_index] = get_controller_status(settings->address);
		if(status_codes[ping_index]==status_codes[0] && status_codes[ping_index]==status_codes[1] &&
				status_codes[ping_index]==status_codes[2] && status_codes[ping_index]==status_codes[3] ){
			sts = status_codes[ping_index];
		}
		else {
			return;
		}

		if(sts != -1){
			curr_status = (sts & 0xC0)>>6;
			curr_time = sts & 0x3F;
		} else {
			curr_status = -1;
			curr_time = 0;
		}

		curr_time = FromBCD(curr_time);
		if(curr_status != -1)
		{
			device_status = curr_status;

		}
	}
}

void send_time(void){
	// Ping solarium for status
	if(settings->address >15){
		curr_status = -1;
		curr_time = 0;
	} else {
		int retry = 0;
		int timeout2 = 10000;
		char data;
		int time_in_hex = ToBCD(main_time);
		pre_time = pre_time & 0x7F;
		// checksum: CoolTime + Pre-Time - 5 - MainTime

		while(retry < 20){
			// clear in FIFO
			volatile unsigned char checksum = (pre_time + cool_time  - time_in_hex - 5) & 0x7F;
			volatile unsigned char  remote_check_sum = 220;
//			while(USART_GetFlagStatus(USART1,USART_FLAG_RXNE))	USART_ReceiveData(USART1); // Flush input
//			while (USART_GetFlagStatus(USART1, USART_FLAG_TXE) == RESET); // wAIT UNTIL TX BUFFER IS EMPTY

			USART_SendData(0x80U | ((settings->address & 0x0fU)<<3U) | 2U); //Command 2 == Pre_time_set
			SystickDelay(2);
			USART_SendData(pre_time);

			SystickDelay(2);
			USART_SendData(0x80U | ((settings->address & 0x0fU)<<3U) | 5U); //Command 5 == Main time set

			SystickDelay(2);
			USART_SendData(time_in_hex);

//			SystickDelay(2);


//			USART_ReceiveData(USART1); //"Read" old time

			SystickDelay(2);
			USART_SendData(0x80U | ((settings->address & 0x0fU)<<3U) | 3U); //Command 3 == Cool Time set

			SystickDelay(2);
			USART_SendData(cool_time);

			SystickDelay(4);
			timeout2 = 10000;

			remote_check_sum = USART_ReceiveData(&timeout2); //"Read" checksum

			SystickDelay(20);
//			checksum = remote_check_sum;
			if(remote_check_sum == checksum){
				SystickDelay(2);
				USART_SendData(checksum);
			}
			SystickDelay(100);
			USART_SendData(0x80U | ((settings->address & 0x0f)<<3U) | 0); //Command 0 - Get status
			SystickDelay(20);
			timeout2 = 10000;
			data = USART_ReceiveData(&timeout2); //"Read" status
			if ((data >> 6 ) != 0 ) retry = 22;
			retry ++;
		}

		/**************** OLD Pascal code as example
		CheckSum:=PreTime+CoolTime-DataSent-5;
		    CheckSum:=CheckSum mod 128 ;
		    PurgeComm(hDevice,(PURGE_TXCLEAR or PURGE_RXCLEAR	));
		    while retry<20 do
		     begin
		      for i:=1 to 10 do IOResult:=ReadFile(hDevice,IOByte,1,IOCount,NIL);
		      Data1:=128+Chanel*8+2;
		      IOResult:=WriteFile(hDevice,Data1,1,IOCount,NIL);
		      sleep(2);             // Set PRE-Time
		      IOResult:=WriteFile(hDevice,PreTime,1,IOCount,NIL);
		      Data1:=128+Chanel*8+5;
		      sleep(2);              // Set main time
		      IOResult:=WriteFile(hDevice,Data1,1,IOCount,NIL);
		      sleep(2);
		      IOResult:=WriteFile(hDevice,DataSent,1,IOCount,NIL);
		      sleep(2);
		      IOResult:=ReadFile(hDevice,IOByte,1,IOCount,NIL);   // get old main time
		      Data1:=128+Chanel*8+3; //  Set cool time
		      IOResult:=WriteFile(hDevice,Data1,1,IOCount,NIL);
		      sleep(2);
		      IOResult:=WriteFile(hDevice,CoolTime,1,IOCount,NIL);
		      sleep(4);
		      IOResult:=ReadFile(hDevice,IOByte,1,IOCount,NIL); // Get checksum?
		      if IOResult and (IOByte=CheckSum) then
		      IOResult:=WriteFile(hDevice,CheckSum,1,IOCount,NIL);
		      sleep(100);
		      Data1:=128+Chanel*8; // Get status command for selected chanel
		      IOResult:=WriteFile(hDevice,Data1,1,IOCount,NIL);
		      sleep(5);
		      IOResult:=ReadFile(hDevice,IOByte,1,IOCount,NIL);
		      IOByte:= IOByte div 64;
		      if IOResult and (IOByte <>0) and
		        ((DataSent=0) or (PreTime > 0) or ((IOByte = 1) and (DataSent >0)))    then
		        begin
		          retry:=22;
		        end
		      else retry:= retry+1;
		      sleep(1);
		      MainForm.Gauge2.Progress:=retry;
		     end;
		     IOResult:=ReadFile(hDevice,IOByte,1,IOCount,NIL);
		     IOResult:=ReadFile(hDevice,IOByte,1,IOCount,NIL);

		*/
	}
}

void send_start(void){
	// Ping solarium for status
	if(settings->address >15){
		curr_status = -1;
		curr_time = 0;
	} else {
//			while(USART_GetFlagStatus(USART1,USART_FLAG_RXNE))	USART_ReceiveData(USART1); // Flush input
//			while (USART_GetFlagStatus(USART1, USART_FLAG_TXE) == RESET); // wAIT UNTIL TX BUFFER IS EMPTY

			USART_SendData(0x80 | ((settings->address & 0x0f)<<3) | 1); //Command 1 == start
			SystickDelay(2);
			USART_SendData(0x55);
	}
}
#endif